kateloop/453-project/PIC18/code/main.c
    adc_conversion ();

    cur_inputs[conv_result.adc_channel] = conv_result.result;

    if (cur_inputs[conv_result.adc_channel] != prev_inputs[conv_result.adc_channel]) {
        change_val = 1;
        prev_inputs[conv_result.adc_channel] = cur_inputs[conv_result.adc_channel];
        index = conv_result.adc_channel;
    } else {
        change_val = 0;
    }

    // TODO Reenable Interrupts

}


//////////////////////////////////////////////
// Function that processes ADC data from    //
// 7 inputs in a sequential fashion         //
//////////////////////////////////////////////

void adc_conversion() {

    ADON = 0;   // Turn off ADC

    ADRESH = 0; // reset result registers
    ADRESL = 0;

    // set ADCON0 register, start conversion, write result in new
    switch (adc_num) {
        case ADCCHANA :
            ADCON0 = ADCON0_CHANA;
            break;
        case ADCCHANB :
            ADCON0 = ADCON0_CHANB;
            break;
        case ADCCHANC :
            ADCON0 = ADCON0_CHANC;
            break;
        case ADCCHAND :
            ADCON0 = ADCON0_CHAND;
            break;
        case ADCCHANE :
            ADCON0 = ADCON0_CHANE;
            break;
        case ADCCHANF :
            ADCON0 = ADCON0_CHANF;
            break;
        case ADCCHANG :
            ADCON0 = ADCON0_CHANG;
            break;
    }


    // Start conversion and wait for result
    ADON = 1;   // Turn on ADC
    GODONE = 1; // Starts conversion

    // Wait for conversion to finish
    while (GODONE) {
        ADON = 0;
    }

    unsigned char note = getNote(ADRESH, ADRESL);

    // store conversion result
    conv_result.result = note;
    conv_result.adc_channel = adc_num;

    // Increase the number of the ADC for next conversion
    adc_num++;
    if (adc_num >= NUMADCCHAN) {
        adc_num = ADCCHANA;
    }
}

unsigned char getNote (unsigned char hResult, unsigned char lResult) {
    unsigned char new_note;

    if (adc_num == ADCCHANA) {
        if (hResult == 0x00) {
            // no note playing; ignore this sensor result???
            new_note = 0x00;
        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5AF
                new_note = 0x51;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5A
                new_note = 0x41;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5AS
                new_note = 0x49;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4AF
                new_note = 0x31;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4A
                new_note = 0x21;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4AS
                new_note = 0x29;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3AF
                new_note = 0x11;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3A
                new_note = 0x01;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3AS
                new_note = 0x09;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    } else if (adc_num == ADCCHANB) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;
        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5BF
                new_note = 0x52;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5B
                new_note = 0x42;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5BS
                new_note = 0x4a;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4BF
                new_note = 0x32;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4B
                new_note = 0x22;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4BS
                new_note = 0x2a;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3BF
                new_note = 0x12;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3B
                new_note = 0x02;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3BS
                new_note = 0x0a;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHANC) {
        if (hResult == 0x00) {
           // No note playing
           new_note = 0x00;
        } else if (hResult == 0x01) {
           if (lResult >= 0x00 && lResult <= 0x00) {
               // 5CF
               new_note = 0x53;
           } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5C
                new_note = 0x43;
           } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5CS
                new_note = 0x4b;
           } else {
                // no note playing
                new_note = 0x00;
           }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4CF
                new_note = 0x33;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4C
                new_note = 0x23;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4CS
                new_note = 0x2b;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3CF
                new_note = 0x13;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3C
                new_note = 0x03;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3CS
                new_note = 0x0b;
            } else {
                // no note playing
                new_note = 0x00;
            }
        }

    } else if (adc_num == ADCCHAND) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;

