kateloop/453-project/PIC18/code/main.c
        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5DF
                new_note = 0x54;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5D
                new_note = 0x44;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5DS
                new_note = 0x4c;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4DF
                new_note = 0x34;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4D
                new_note = 0x24;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4DS
                new_note = 0x2c;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3DF
                new_note = 0x14;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3D
                new_note = 0x04;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3DS
                new_note = 0x0c;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    } else if (adc_num == ADCCHANE) {
        if (hResult == 0x00) {
            // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5EF
                new_note = 0x55;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5E
                new_note = 0x45;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5ES
                new_note = 0x4d;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4EF
                new_note = 0x35;

            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4E
                new_note = 0x25;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4ES
                new_note = 0x2d;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3EF
                new_note = 0x15;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3E
                new_note = 0x05;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3ES
                new_note = 0x0d;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    } else if (adc_num == ADCCHANF) {
        if (hResult == 0x00) {
           // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5FF
                new_note = 0x56;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5F
                new_note = 0x46;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5FS
                new_note = 0x4e;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4FF
                new_note = 0x36;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4F
                new_note = 0x26;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4FS
                new_note = 0x2e;
            } else {
               // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3FF
                new_note = 0x16;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3F
                new_note = 0x06;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3FS
                new_note = 0x0e;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    } else if (adc_num == ADCCHANG) {
        if (hResult == 0x00) {
           // no note playing
            new_note = 0x00;

        } else if (hResult == 0x01) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 5GF
                new_note = 0x57;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5G
                new_note = 0x47;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 5GS
                new_note = 0x4f;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x02) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 4GF
                new_note = 0x37;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4G
                new_note = 0x27;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 4GS
                new_note = 0x2f;
            } else {
                // no note playing
                new_note = 0x00;
            }

        } else if (hResult == 0x03) {
            if (lResult >= 0x00 && lResult <= 0x00) {
                // 3GF
                new_note = 0x17;

            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3G
                new_note = 0x07;
            } else if (lResult >= 0x00 && lResult <= 0x00) {
                // 3GS
                new_note = 0x0f;
            } else {
                // no note playing
                new_note = 0x00;
            }

        }

    }
    return new_note;
}